# ? Порядок выполнения операций в алгебре логики
# * 1. Отрицание / Инверсия (¬A)                        not A
# * 2. Логическое умножение / Конъюнкция (A∧B, A∙B)     A and B
# * 3. Логическое сложение / Дизъюнкция (A∨B, A+B)      A or B
# * 4. Следование / Импликация (A→B)                    A <= B
# * 5. Тождество / Эквивалентность (A≡B)                A == B

# ? Порядок выполнения операций в Python
# * 1. ()
# * 2. **
# * 3. *, /, //, %
# * 4. +, -
# * 5. in, not in
# * 6. ==, !=, >, >=, <, <=
# * 7. ^
# * 8. not
# * 9. and
# * 10. or

# ? Решение через лесенку
print('x y z w')
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                f = (not x and not y) or (w == z) or w
                # Все строки истинны
                if f:
                    print(x, y, z, w)
                # Все строки ложны
                if not f:
                    print(x, y, z, w)
                # Строки вперемешку
                print(x, y, z, w)